web/application/files/fedex/wsdl/ShipService_v12/ProcessShipmentRequest_FXF_v12.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<SOAP-ENV:Body>
<ProcessShipmentRequest xmlns="http://fedex.com/ws/ship/v12">
<WebAuthenticationDetail>
<UserCredential>
<Key>
</Key>
<Password/>
</UserCredential>
</WebAuthenticationDetail>
<ClientDetail>
<AccountNumber>
</AccountNumber>
<MeterNumber>
</MeterNumber>
</ClientDetail>
<TransactionDetail>
<CustomerTransactionId>M_BOL_FXFR_TC_015_ECON_Shipper Prepaid Liftgate at Delivery Collect</CustomerTransactionId>
</TransactionDetail>
<Version>
<ServiceId>ship</ServiceId>
<Major>12</Major>
<Intermediate>1</Intermediate>
<Minor>0</Minor>
</Version>
<RequestedShipment>
<ShipTimestamp>2012-08-17T11:43:22-06:00</ShipTimestamp>
<DropoffType>REGULAR_PICKUP</DropoffType>
<ServiceType>FEDEX_FREIGHT_ECONOMY</ServiceType>
<PackagingType>YOUR_PACKAGING</PackagingType>
<TotalWeight>
<Units>LB</Units>
<Value>550.0</Value>
</TotalWeight>
<PreferredCurrency/>
<Shipper>
<Contact>
<PersonName/>
<CompanyName>ORECK VACUUM LENEXA #5</CompanyName>
<PhoneNumber>870-743-2200</PhoneNumber>
<PhoneExtension/>
<EMailAddress/>
</Contact>
<Address>
<StreetLines>11952 W 95TH ST</StreetLines>
<City>LENEXA</City>
<StateOrProvinceCode>KS</StateOrProvinceCode>
<PostalCode>66215</PostalCode>
<CountryCode>US</CountryCode>
</Address>
</Shipper>
<Recipient>
<Contact>
<PersonName>Sally Jones</PersonName>
<CompanyName>Humming Birds Feeder</CompanyName>
<PhoneNumber>9403808200</PhoneNumber>
<PhoneExtension/>
<EMailAddress/>
</Contact>
<Address>
<StreetLines>123 MAIN STREET</StreetLines>
<City>EVERETT</City>
<StateOrProvinceCode>WA</StateOrProvinceCode>
<PostalCode>98203</PostalCode>
<CountryCode>US</CountryCode>
</Address>
</Recipient>
<ShippingChargesPayment>
<PaymentType>SENDER</PaymentType>
<Payor>
<ResponsibleParty>
<AccountNumber>
</AccountNumber>
<Contact>
<PersonName/>
<CompanyName>ORECK VACUUM LENEXA #5</CompanyName>
<PhoneNumber>870-743-2200</PhoneNumber>
<PhoneExtension/>
<EMailAddress/>
</Contact>
<Address>
<StreetLines>11952 W 95TH ST</StreetLines>
<City>LENEXA</City>
<StateOrProvinceCode>KS</StateOrProvinceCode>
<PostalCode>66215</PostalCode>
<CountryCode>US</CountryCode>
</Address>
</ResponsibleParty>
</Payor>
</ShippingChargesPayment>
<SpecialServicesRequested>
<SpecialServiceTypes>EMAIL_NOTIFICATION</SpecialServiceTypes>
<SpecialServiceTypes>LIFTGATE_DELIVERY</SpecialServiceTypes>
<SpecialServiceTypes>EXTREME_LENGTH</SpecialServiceTypes>
<EMailNotificationDetail>
<AggregationType>PER_PACKAGE</AggregationType>
<PersonalMessage>Test Case 151 for BOL Notification</PersonalMessage>
<Recipients>
<EMailNotificationRecipientType>SHIPPER</EMailNotificationRecipientType>
<EMailAddress>Sunil_Yadav3@syntelinc.com</EMailAddress>
<NotificationEventsRequested>ON_SHIPMENT</NotificationEventsRequested>
<Format>TEXT</Format>
<Localization>
<LanguageCode>EN</LanguageCode>
</Localization>
</Recipients>
<Recipients>
<EMailNotificationRecipientType>RECIPIENT</EMailNotificationRecipientType>
<EMailAddress>Shriyash_Khisti@syntelinc.com</EMailAddress>
<NotificationEventsRequested>ON_EXCEPTION</NotificationEventsRequested>
<Format>TEXT</Format>
<Localization>
<LanguageCode>EN</LanguageCode>
</Localization>
</Recipients>
</EMailNotificationDetail>
</SpecialServicesRequested>
<FreightShipmentDetail>
<FedExFreightAccountNumber>
</FedExFreightAccountNumber>
<FedExFreightBillingContactAndAddress>
<Contact>
<PersonName/>
<CompanyName>ORECK VACUUM LENEXA #5</CompanyName>
<PhoneNumber>870-743-2200</PhoneNumber>
<PhoneExtension/>
<EMailAddress/>
</Contact>
<Address>
<StreetLines>11952 W 95TH ST</StreetLines>
<City>LENEXA</City>
<StateOrProvinceCode>KS</StateOrProvinceCode>
<PostalCode>66215</PostalCode>
<CountryCode>US</CountryCode>
</Address>
</FedExFreightBillingContactAndAddress>
<PrintedReferences>
<Type>BILL_OF_LADING</Type>
<Value>1234</Value>
</PrintedReferences>
<Role>SHIPPER</Role>
<CollectTermsType>STANDARD</CollectTermsType>
<DeclaredValuePerUnit>
<Currency>USD</Currency>
<Amount>550</Amount>
</DeclaredValuePerUnit>
<DeclaredValueUnits>LB</DeclaredValueUnits>
<TotalHandlingUnits>2</TotalHandlingUnits>
<ClientDiscountPercent>0</ClientDiscountPercent>
<SpecialServicePayments>
<SpecialService>LIFTGATE_DELIVERY</SpecialService>
<PaymentType>CONSIGNEE</PaymentType>
</SpecialServicePayments>
<LineItems>
<FreightClass>CLASS_150</FreightClass>
<HandlingUnits>2</HandlingUnits>
<Packaging>CRATE</Packaging>
<Pieces>2</Pieces>
<NmfcCode/>
<PurchaseOrderNumber>4321</PurchaseOrderNumber>
<Description>Glass</Description>
<Weight>
<Units>LB</Units>
<Value>550</Value>
</Weight>
</LineItems>
</FreightShipmentDetail>
<DeliveryInstructions>Ops BOL Matrix 03-06-12</DeliveryInstructions>
<CustomsClearanceDetail>
<CustomsValue>
<Currency>USD</Currency>
<Amount>50.0</Amount>
</CustomsValue>
<Commodities>
<Name/>
<NumberOfPieces>2</NumberOfPieces>
<Description>Glass</Description>
<CountryOfManufacture>US</CountryOfManufacture>
<HarmonizedCode>1111</HarmonizedCode>
<Weight>
<Units>LB</Units>
<Value>275</Value>
</Weight>
<Quantity>1</Quantity>
<QuantityUnits>LB</QuantityUnits>
<AdditionalMeasures>
<Quantity>3</Quantity>
<Units>LB</Units>
</AdditionalMeasures>
<UnitPrice>
<Currency>USD</Currency>
<Amount>50.0</Amount>
</UnitPrice>
<CustomsValue>
<Currency>USD</Currency>
<Amount>50.0</Amount>
</CustomsValue>
<ExciseConditions>
<Category/>
<Value/>
</ExciseConditions>
</Commodities>
</CustomsClearanceDetail>
<LabelSpecification>
<LabelFormatType>FEDEX_FREIGHT_STRAIGHT_BILL_OF_LADING</LabelFormatType>
<ImageType>PDF</ImageType>
<LabelStockType>PAPER_LETTER</LabelStockType>
<LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</LabelPrintingOrientation>
</LabelSpecification>
<ShippingDocumentSpecification>
<ShippingDocumentTypes>FREIGHT_ADDRESS_LABEL</ShippingDocumentTypes>
<FreightAddressLabelDetail>
<Format>
<ImageType>PDF</ImageType>
<StockType>PAPER_4X6</StockType>
<ProvideInstructions>0</ProvideInstructions>
<Localization>
<LanguageCode>EN</LanguageCode>
<LocaleCode>US</LocaleCode>
</Localization>
<CustomDocumentIdentifier>M_BOL_FXFR_TC_015_ECON_Shipper Prepaid Liftgate at Delivery Collect</CustomDocumentIdentifier>
</Format>
<Copies>1</Copies>
</FreightAddressLabelDetail>
</ShippingDocumentSpecification>
<RateRequestTypes>ACCOUNT</RateRequestTypes>
<PackageCount>1</PackageCount>
</RequestedShipment>
</ProcessShipmentRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>